<?php
if(!defined('__AFOX__')) exit();
// 설정값을 만들때는 모든 값의 합이 65000바이트를 넘지않게 설계한다 (최대 저장 가능한 크기가 약 65000바이트)

$default_filter = '18놈,18새끼,18년,18뇬,18넘,개년,개놈,개뇬,개색끼,개세끼,개세이,개쉐이,개쉑,개쉽,개시키,개자식,개좆,게색기,게색끼,되질래,뒈져라,뒈진다,디져라,디진다,디질래,병쉰,병신,빠큐,뻐큐,뻑큐,뽁큐,새꺄,쉬발,쉬밸,쉬팔,쉽알,스패킹,시벌,시부랄,시부럴,시브랄,시팍,시팔,시펄,실밸,십8,십쌔,십창,싶알,쌉년,썅놈,쌔끼,썩을년,쎄꺄,쎄엑,쓰발,쓰벌,쓰팔,씨8,씨발,씨뱅,씨봉알,씨부랄,씨부럴,씨부렁,씨브랄,씨빨,씨뽀랄,씨팍,씨팔,씨펄,아가리,아갈이,엄창,접년,잡놈,저주글,조까,조빠,조쟁이,조지냐,조진다,조질래,존나,좀물,좁년,쥐랄,쥐롤,쥬디,지랄,지럴,지롤,지미랄,쫍빱';
?>

<div class="form-group">
	<label for="id_filter">필터</label>
	<textarea maxbyte="65000" maxlength="65000" class="form-control mh-10 vresize" name="filter" id="id_filter"><?php echo escapeHtml(empty($_ADDON['filter'])?$default_filter:$_ADDON['filter'])?></textarea>
	<p class="help-block">입력된 단어가 있으면 착한말로 바꿔줍니다. (단어와 단어 사이는 ,로 구분합니다)</p>
</div>
